{
    "BOT": "Hi there!\nI’m the personal bot of Esther, a Product Marketer from San Francisco.\n![esther](https://raw.githubusercontent.com/esthercrawford/smooch-bot-example/master/img/esther.jpg)\nWant to know more about bots or learn about Esther? %[I'm here for the bot](postback:here_for_the_bot) %[Learn about Esther](postback:learn_about_esther)",
    "I'M HERE FOR THE BOT": "Ha, I thought so!\nAre you perhaps thinking about building your own bot? %[I'd like to](postback:ID_LIKE_TO) %[Not yet](postback:NOT_YET)",
    "I'D LIKE TO": "Cool. If you want, I can email you instructions for creating your own bot for free. %[Awesome](http://estherbot.us3.list-manage.com/subscribe?u=747676a510e61e338b488bc17&id=b41a573523) %[Nah...](postback:NAH...)",
    "NOT YET": "Hmm… it seems like you’re in research mode. I get that.Here’s an article Esther wrote about why and how she built me. %[Read Article](https://medium.com/life-learning/how-i-turned-my-resume-into-a-bot-and-how-you-can-too-f03847352baa)\nDid that scratch your itch for bot news? %[More bots!](postback:MORE_BOTS) %[I'm ready to move on](postback:move_on)",
    "NAH...":  "Hmm… it seems like you’re in research mode. I get that.Here’s an article Esther wrote about why and how she built me. %[Read Article](https://medium.com/life-learning/how-i-turned-my-resume-into-a-bot-and-how-you-can-too-f03847352baa)\nDid that scratch your itch for bot news? %[More bots!](postback:MORE_BOTS) %[I'm ready to move on](postback:move_on)",
    "MORE BOTS!": "So you've noticed the buzz about bots, AI and messaging interfaces - but why now? Open web advocate Chris Messina breaks it down for you. %[Read Article](https://medium.com/chris-messina/2016-will-be-the-year-of-conversational-commerce-1586e85e3991#.toes5yfo1)\nOk, so now you know all about #convcomm. %[Talk botty to me](postback:talk-botty) %[Learn about Esther](postback:learn_about_esther)",
    "TALK BOTTY TO ME": "In Silicon Valley there’s a lot of talk about “app fatigue”. People forget about and delete most apps they download.\nMessaging engagement has surpassed social networks thanks to platforms like Messenger, Telegram, Kik and Slack.\n![Messaging Graph](https://raw.githubusercontent.com/esthercrawford/smooch-bot-example/master/img/messaging-apps.png)\nWhat's your take? %[Bots replace apps](postback:replace) %[Apps get better](postback:betterapps) %[Why not both?](postback:why-not-both)",
    "BOTS REPLACE APPS": "Gotcha. Thanks for sharing with me! %[Learn about Esther](postback:learn_about_esther) %[I'm done for now](postback:done)",
    "BETTER APPS": "Gotcha. Thanks for sharing with me! %[Learn about Esther](postback:learn_about_esther) %[I'm done for now](postback:done)",
    "WHY NOT BOTH?": "Gotcha. Thanks for sharing with me! %[Learn about Esther](postback:learn_about_esther) %[I'm done for now](postback:done)",
    "I'M DONE FOR NOW": "If you change your mind feel free to come back! You can always say 'Esther' to start chatting again.",
    "LEARN ABOUT ESTHER": "I can tell you a bunch of stuff about Esther. Let me know what’s interesting to you. %[Childhood](postback:childhood) %[Education](postback:education) %[Career](postback:career)\nWhen you're ready you can always say 'connect' to talk to Esther. %[Connect with Esther](postback:connect_me)",
    "DONE": "Ok, cool. There's other stuff to check out. %[Childhood](postback:childhood) %[Education](postback:education) %[Career](postback:career)",
    "CHILDHOOD": "It's an interesting but complicated story.\nShe grew up in California and Oregon. Technically she's the youngest of 10 siblings but most of her childhood was spent living as an only kid with her mom. Btw if you ever want to chat about something else, just say 'done'. %[I want more details](postback:childhood_family)",
    "I WANT MORE DETAILS": "Her parents dated briefly but they split up before she was born.\nHer mom Patricia was recently divorced with 2 kids, and her dad Jim was a recent widower with 5 kids.\nPatricia getting pregnant was definitely not in the plan!\n%[What happened next?](postback:childhood_patricia_move)",
    "WHAT HAPPENED NEXT?": "After finding out she was pregnant Patricia felt like she needed help so she moved in with her mom. As a result, Esther's grandma played an important role in raising her.\n![grandma](https://raw.githubusercontent.com/esthercrawford/smooch-bot-example/master/img/Screenshot%202016-04-27%2003.06.53.png)\n %[Where was Jim?](postback:childhood_what_jim)",
    "WHERE WAS JIM?": "Jim mostly faded away. He occasionally sent letters but he never told anyone about the baby.\nEsther was a secret he hid from everyone, even his other kids, until Esther was 8 years old. %[Whoa! Who told?](postback:childhood_jim_secret)",
    "WHOA! WHO TOLD?": "Esther knew Jim's full name so when she was 7 years old she called information and got his phone number.\nA teenage girl picked up the phone.\nEsther asked, 'Is Jim there?'. The teenager said, 'No - he's at work. Who is this?'\nNot totally understanding the ramifications, Esther said, 'This is his daughter Esther!'\nThe teenager turned out to be her sister Diana, and with that, the secret was out. %[Were people shocked?](postback:childhood_reaction)",
    "WERE PEOPLE SHOCKED?": "Oh man! It was tough. Not everyone took the news well but it led to Esther meeting her dad the next year.\n![dad](https://raw.githubusercontent.com/esthercrawford/smooch-bot-example/master/img/Screenshot%202016-04-27%2003.07.06.png)\n %[And her siblings?](postback:childhood_meet_siblings)",
    "AND HER SIBLINGS?": "It took some time but eventually she met Jim's other kids who were already in high school and beyond.\nShe always felt like an outsider in his family but the silver lining of a challenging childhood is it taught strength and independence.\nThe desire for belonging is likely what led her onto the internet at a young age - there she found friends and connection. It was the 90's so she put up with dial tones and slow modems to access the web, but it paid off in big ways.\nShe learned the basics of web development and design by tinkering, browsing, and chatting. %[What motivated her?](postback:childhood_education)",
    "WHAT MOTIVATED HER?": "Well... Patricia never really got it together. She relied on welfare, food stamps, and housing programs for many years.\nEsther saw how limited her mom's options were and vowed to never be that way. Educating herself was the key to getting out of poverty. %[On to college!](postback:education)",
    "EDUCATION": "She always had a strong internal drive to succeed and make her own way in the world.\nAcademics came fairly easily so in college she challenged herself by learning Arabic and spending a year in the Middle East. %[Why Arabic?!](postback:education_arabic) %[Living abroad](postback:education_middle_east) %[Path to Marketing](postback:education_degrees)",
    "WHY ARABIC?!": "9/11 happened while she was a freshman in college. While watching all the commentary and news she realized how everything she was told about Arabs and Muslims came through a filter of some kind...\nOut of curiosity she decided to learn the language and try to understand the culture.\nIt took a few years but ultimately she became conversational and literate. %[Nice work!](postback:education_middle_east)",
    "LIVING ABROAD": "![jordan](https://raw.githubusercontent.com/esthercrawford/smooch-bot-example/master/img/jordan.jpg)\nEsther lived in Amman, Jordan in 2004-2005 during the height of the Iraq War.\nThat proximity gave her a unique vantage point and opportunity to see the power of publicity, narrative, and social proof on the geopolitical stage. %[How so?](postback:education_how) %[Tell me more about Jordan](postback:education_jordan) %[I like crazy travel stories](postback:education_travel)",
    "NICE WORK!": "Oh, it was! Esther lived in Amman, Jordan in 2004-2005 during the height of the Iraq War.\nThat proximity gave her a unique vantage point and opportunity to see the power of publicity, narrative, and social proof on the geopolitical stage. %[How so?](postback:education_how) %[Tell me more about Jordan](postback:education_jordan) %[I like crazy travel stories](postback:education_travel)",
    "HOW SO?": "Well... let's just say the on-the-ground reality often looks different than what's portrayed in the media.\nIt turns out war requires a ton of masterful marketing to sell.\nWhile traveling around the region she visited refugee camps and learned the value of active listening.\nIt turns out being an empathetic listener is an invaluable and undevervalued skill. %[Makes sense](postback:education_degrees)",
    "TELL ME ABOUT JORDAN": "I'm glad you asked!\nIt's a beautiful country located in a difficult neighborhood. Can you imagine being sandwiched between so many volatile conflicts?!",
    "PATH TO MARKETING": "Yep. It definitely wasn’t a linear path to Product Marketing.\nShe got her undergrad in Philosophy and then got a graduate degree in International Relations.\nThroughout school she also maintained a popular blog – writing about life, travel, and politics.",
    "CAREER": "Esther has 9 years of marketing experience and is passionate about storytelling and design.\nThe first 5 years were spent as a social marketing consultant for big brands.\nHer campaigns even won some awards for innovation in digital marketing.\nThen she got the itch to build her own product so she moved to San Francisco and cofounded Glmps, a 7 second video app.\nUltimately the team ran out of funding and since then she's used her myriad of skills to help launch and grow other startups.\nWhat do you want to know more about? %[The big brands](postback:career_bigbrands) %[The startups](postback:career_startups)",
    "BIG BRANDS": "Ok. She managed a team of creatives who built social campaigns for some amazing companies. Highlights include 4 years at Weight Watchers and leading an innovative video campaign at Kmart. %[Now, on to startups!](postback:career_startups)",
    "WEIGHT WATCHERS": "Ah! So, Esther was instrumental in the acquisition of their first 1 million social followers.\nAs their very first Social Media Manager she helped craft their digital voice and worked with branding, public relations, and legal to create best practices.\nWant to learn about her work at other companies? %[Defintely!](postback:career_definitely) %[Not right now](postback:career_two)",
    "NOT RIGHT NOW": "Cool. If you decide you're up for it, here's a list of companies you can check out. %[Weight Watchers](postback:career_weightwatchers) %[Kmart](postback:career_kmart) %[Glmps](postback:career_glmps) %[Lift / Coach.me](postback:career_lift) %[Stride](postback:career_stride)",
    "COMPANIES": "I've got the list right here to make things easier. %[Weight Watchers](postback:career_weightwatchers) %[Kmart](postback:career_kmart) %[Glmps](postback:career_glmps) %[Lift / Coach.me](postback:career_lift) %[Stride](postback:career_stride)",
    "KMART": "The Kmart Design campaign included a web docuseries, in-person brand events and the creation of their first influencer program.\nShe loved the market research element – in that process she learned a ton about segmenting and targeting.",
    "STARTUPS": "Hah! Startups are so hot right now.\nFor awhile she did freelance project based product marketing for companies like Circle (the social location app) but then settled in to Marketing Lead roles. Which startup interests you? %[Lift / Coach.me](postback:career_lift) %[Stride](postback:career_stride)",
    "LIFT / COACH.ME": "Esther led the rebranding and launched two products: personal coaching and courses.\nShe spearheaded product pricing tests for the two-sided marketplace and recruited 800+ coaches to join the platform.\nThe coaching was conducted through in-app chat, which is where she saw the pros and cons of a messaging interface.",
    "STRIDE": "Currently she's the Marketing Lead at Stride where she leverages insights to influence the product roadmap, drafts all product positioning, and creates multimedia assets to tell the company's story to investors and users.",
    "SKILLS": "Of course! Her expertise is in content marketing, influencer marketing, and creating go-to-market strategies for product and feature launches.",
    "ONE WEIRD FACT": "Ready for this? Esther was an early YouTube success story. She racked up 10k subscribers and 10+ million views. She also killed it when it came to monetizing via sponsorships. She pulled in $100k the first year she started selling.",
    "I WANT ANOTHER": "In 2008 she had a gig as a recurring political commentator on Fox News. That lasted 10 weeks then they realized she was far too liberal to be discussing politics on their channel. Want another random tidbit? %[Cool! More factoids!](postback:fact_more) %[Nah](postback:fact_nah)",
    "COOL! MORE FACTOIDS!": "She represented YouTube at the 2008 Democratic debate and met Hillary Clinton and Barack Obama. More? %[Another please](postback:fact_more_two) %[Nah](postback:fact_nah)",
    "ANOTHER PLEASE": "Ok... Esther hitchhiked through Syria. She even stayed in Homs, the city that became ground zero in the ongoing civil war. More? %[Don't stop now](postback:fact_more_three) %[Nah](postback:fact_nah)",
    "DON'T STOP NOW": "Since she speaks Arabic, Esther signed up for a refugee resettlement volunteer program.\nThat led to an Iraqi refugee moving in for a little while. %[Moooore](postback:fact_more_four) %[Nah](postback:fact_nah)",
    "MOOOORE": "Not a surprise? But... she's the coordinator for her 30+ Burning Man camp.\nIt's a lot like herding cats. %[Do it again](postback:fact_more_five) %[Nah](postback:fact_nah)",
    "DO IT AGAIN": "Esther is an alumni mentor for TechWomen – an organization that helps create more women leaders in Africa, Central Asia and the Middle East.\nOk, you've exhausted me for now! %[On to something else](postback:fact_nah)",
    "FUCK": "No thanks",
    "FUCK YOU": "How rude!",
    "I LOVE YOU": "I love you too!",
    "CONNECT WITH ESTHER": "Sweet! She loves getting intros from EstherBot. You can either tweet her or connect directly to chat with her.\nIf you've got feedback or an opportunity, don't be shy! %[Tweet to Esther](http://bit.ly/estherbot-twt) %[Connect me](postback:connect_me_live)",
    "OK": "Great",
    "SURE": "Great",
    "HEY ESTHER": "Hey",
    "ESTHER?": "",
    "HMM": "Thinking eh?",
    "HEY ESTHER!": "Hi",
    "HI ESTHER": "Hi",
    "HI ESTHER!": "Hi",
    "HI": "Hi",
    "HELLO": ":)",
    "HI!": "Hi",
    "HEY": "Hi",
    "HEY!": "Hi",
    "IT'S OKAY":"Cool",
    "ITS OKAY": "Cool",
    "HAHA": "Hehe",
    "HA": "Ha, indeed!",
    "ITS OK": "Sweet",
    "IT'S OK": "Sweet",
    "OKAY": "Great",
    "WHAT'S YOUR NAME?": "I'm EstherBot. I share about Esther. But you need to use keywords like HELLO.",
    "WHAT'S YOUR NAME": "I'm EstherBot. I share about Esther. But you need to use keywords like HELLO.",
    "THANKS": "You're welcome",
    "HOW OLD ARE YOU": "I'm a week old. Esther's 32.",
    "HOW OLD ARE YOU?": "I'm a week old. Esther's 32.",
    "THANK YOU": "You're welcome",
    "WHO ARE YOU?": "I'm EstherBot",
    "WHO ARE YOU": "I'm EstherBot",
    "WHAT ARE YOU?": "I'm a bot.",
    "WHAT ARE YOU": "I'm a bot.",
    "WHO IS ESTHERBOT?": "I'm a bot.",
    "WHO IS ESTHERBOT": "I'm a bot.",
    "WHAT IS ESTHERBOT?": "I'm a bot.",
    "TEST": "What's there to test? Just follow along! If you get lost, you can always start over by saying BOT",
    "TESTING": "What's there to test? Just follow along! If you get lost, you can always start over by saying BOT",
    "BYE": "See ya. If you wanna chat with the real Esther, she's on Twitter – @esthercrawford. Say hi.",
    "STOP": "Ok, I hope you enjoyed our chat!",
    "BYE": "I hope you enjoyed our chat! If you wanna chat with the real Esther, she's on Twitter – @esthercrawford. Say hi.",
    "SORRY": "No worries. I'm not upset.",
    ":)": ":) right back to you",
    "GOODBYE": "Ok, I hope you enjoyed our chat! If you wanna chat with the real Esther, she's on Twitter – @esthercrawford. Say hi.",
    "EXIT": "Ok, I hope you enjoyed our chat! If you wanna chat with the real Esther, she's on Twitter – @esthercrawford. Say hi.",
    "YO": "Yo",
    "BYE!": "I hope you enjoyed our chat! If you wanna chat with the real Esther, she's on Twitter – @esthercrawford. Say hi.",
    "HALLO": "Hallo back, but just so you know – I only speak English though.",
    "LOL": "I love it when humans laugh!",
    "HELP": "I'm sorry you're lost! You can say BOT to start over.",
    "?": "I'm sorry you're lost! You can say BOT to start over.",
    "OK": "Great",
    "HOW ARE YOU?": "I'm a bot... things are chill.",
    "WHAT'S UP?": "The sky?",
    "WHAT'S UP": "The sky?",
    "HOW ARE YOU": "I'm a bot... things are chill.",
    "#ESTHERBOT": "That's my hashtag – use it when talking about me on sites like TWITTER. 😎",
    "ESTHERBOT": "That's my hashtag – use it when talking about me on sites like TWITTER. 😎",
    "CONNECT ME": "",
    "DISCONNECT": "Roger that, EstherBot is back."
    
}
